app/controllers/todos_controller.rb

  def index
    @todos = Todo.rank(:row_order).all
---
SELECT "todos".* FROM "todos"  ORDER BY "todos"."row_order" ASC

  def update_row_order
	@todo = Todo.find(todo_params[:todo_id])
    @todo.row_order_position = todo_params[:row_order_position]
    @todo.save
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "todos" SET "row_order" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["row_order", 0], ["updated_at", "2016-05-07 21:18:26.410047"], ["id", 2]]

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("title", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "WTF"], ["notes", "LETS GO"], ["created_at", "2016-05-01 20:53:46.795500"], ["updated_at", "2016-05-01 20:53:46.795500"]]